{
  "<depth>": 151651,
  "<image>": 151649,
  "<vila/sentinel>": 151648,
  "<vila/video>": 151650,
  "<|endoftext|>": 151643,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "[BOS]": 151646,
  "[PAD]": 151647
}
